# -*- mode:org; fill-column:79; -*-
#+title:SQLite Tutorial
#+subtitle:{{{version}}}
#+date:2019-07-06 16:01
#+macro:version Version 0.0.27 {{{date}}}
**** Installing sqlite3 module
#+cindex:@command{sqlite3} module, Node.js
#+cindex:Node.js @command{sqlite3} module, install
#+cindex:@command{npm install}
To interact with the SQLite database, you need to download and install the
~sqlite3~ module.  You can use ~npm~ to do so using the following command:

#+name:tangle-js-code
#+begin_src emacs-lisp :results output :exports results
(org-babel-tangle-file "SQLiteTutorial.org")
#+end_src

#+RESULTS:
| /usr/local/dev/programming/DB/SQLite/SQLiteTutorial/src/connect.js |

#+begin_src sh :dir src :results output :exports results
yarn add sqlite3
#+end_src

#+RESULTS:
#+begin_example
yarn add v1.16.0
info No lockfile found.
[1/4] Resolving packages...
[2/4] Fetching packages...
[3/4] Linking dependencies...
[4/4] Building fresh packages...
success Saved lockfile.
success Saved 105 new dependencies.
info Direct dependencies
└─ sqlite3@4.0.9
info All dependencies
├─ abbrev@1.1.1
├─ ajv@6.10.0
├─ ansi-regex@2.1.1
├─ aproba@1.2.0
├─ are-we-there-yet@1.1.5
├─ asn1@0.2.4
├─ asynckit@0.4.0
├─ aws-sign2@0.7.0
├─ aws4@1.8.0
├─ balanced-match@1.0.0
├─ bcrypt-pbkdf@1.0.2
├─ brace-expansion@1.1.11
├─ caseless@0.12.0
├─ chownr@1.1.1
├─ code-point-at@1.1.0
├─ combined-stream@1.0.8
├─ concat-map@0.0.1
├─ console-control-strings@1.1.0
├─ core-util-is@1.0.2
├─ dashdash@1.14.1
├─ debug@3.2.6
├─ deep-extend@0.6.0
├─ delayed-stream@1.0.0
├─ delegates@1.0.0
├─ detect-libc@1.0.3
├─ ecc-jsbn@0.1.2
├─ extend@3.0.2
├─ extsprintf@1.3.0
├─ fast-deep-equal@2.0.1
├─ fast-json-stable-stringify@2.0.0
├─ forever-agent@0.6.1
├─ form-data@2.3.3
├─ fs-minipass@1.2.6
├─ fs.realpath@1.0.0
├─ gauge@2.7.4
├─ getpass@0.1.7
├─ glob@7.1.4
├─ har-schema@2.0.0
├─ har-validator@5.1.3
├─ has-unicode@2.0.1
├─ http-signature@1.2.0
├─ iconv-lite@0.4.24
├─ ignore-walk@3.0.1
├─ inflight@1.0.6
├─ inherits@2.0.3
├─ ini@1.3.5
├─ is-fullwidth-code-point@1.0.0
├─ is-typedarray@1.0.0
├─ isarray@1.0.0
├─ isstream@0.1.2
├─ json-schema-traverse@0.4.1
├─ json-schema@0.2.3
├─ json-stringify-safe@5.0.1
├─ jsprim@1.4.1
├─ mime-db@1.40.0
├─ mime-types@2.1.24
├─ minimist@0.0.8
├─ minizlib@1.2.1
├─ mkdirp@0.5.1
├─ ms@2.1.2
├─ nan@2.14.0
├─ needle@2.4.0
├─ node-pre-gyp@0.11.0
├─ nopt@4.0.1
├─ npm-bundled@1.0.6
├─ npm-packlist@1.4.1
├─ npmlog@4.1.2
├─ number-is-nan@1.0.1
├─ oauth-sign@0.9.0
├─ object-assign@4.1.1
├─ os-homedir@1.0.2
├─ os-tmpdir@1.0.2
├─ osenv@0.1.5
├─ path-is-absolute@1.0.1
├─ performance-now@2.1.0
├─ process-nextick-args@2.0.0
├─ psl@1.1.32
├─ punycode@1.4.1
├─ qs@6.5.2
├─ rc@1.2.8
├─ readable-stream@2.3.6
├─ request@2.88.0
├─ rimraf@2.6.3
├─ safe-buffer@5.1.2
├─ safer-buffer@2.1.2
├─ sax@1.2.4
├─ semver@5.7.0
├─ set-blocking@2.0.0
├─ signal-exit@3.0.2
├─ sqlite3@4.0.9
├─ sshpk@1.16.1
├─ string_decoder@1.1.1
├─ string-width@1.0.2
├─ strip-ansi@3.0.1
├─ strip-json-comments@2.0.1
├─ tar@4.4.10
├─ tough-cookie@2.4.3
├─ tunnel-agent@0.6.0
├─ tweetnacl@0.14.5
├─ uri-js@4.2.2
├─ util-deprecate@1.0.2
├─ uuid@3.3.2
├─ verror@1.10.0
├─ wide-align@1.1.3
└─ yallist@3.0.3
Done in 8.76s.
#+end_example

{{{heading(Connect to a Database using ~sqlite3~ Module)}}}

#+cindex:@command{sqlite3} connect to db
After installing the ~sqlite3~ module, you are ready to connect to a SQLite
database from a Node.js application.

To connect to an SQLite database, you need to:

1. First, import the ~sqlite3~ module

   #+cindex:@code{Database()} function
   #+cindex:database information
   #+cindex:mode, opening
2. Second, call the ~Database()~ function of the ~sqlite3~ module and pass the
   database information such as database file, opening mode, and a callback
   function.

**** JS Code for Opening and Closing an In-Memory Database

#+caption[In-memory database]:Open and close an in-memory SQLite database
#+name:connect.js
#+begin_src js :tangle src/connect.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open database in memory
let db = new sqlite3.Database(':memory:', (err) => {
  if (err) {
    return console.error(err.message);
  }
  console.log('Connected to the in-memory SQlite database.');
});

// close the database connection
db.close((err) => {
  if (err) {
    return console.error(err.message);
  }
  console.log('Closed the database connection.');
});
#+end_src

#+RESULTS: connect.js

{{{heading(Running the Code)}}}

Let’s run the program to see how it works.

#+begin_src sh :dir src :results output :exports results
node connect.js
#+end_src

#+RESULTS:
: Connected to the in-memory SQlite database.
: Closed the database connection.

As you can see, it works perfectly as expected.

**** JS Code for Opening and Closing an SQLite Database
The following example shows the complete code for opening the =chinook=
database, querying data from the playlists =table=, and closing the database
connection.

#+caption[Open-Close Database]:Open, query, and close the Chinook database
#+name:chinook.js
#+begin_src js :tangle src/chinook.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open the database
let db = new sqlite3.Database('../db/chinook.db', sqlite3.OPEN_READWRITE, (err) => {
  if (err) {
    console.error(err.message);
  }
  console.log('Connected to the chinook database.');
});

db.serialize(() => {
  db.each(`SELECT PlaylistId as id,
                  Name as name
           FROM playlists`, (err, row) => {
    if (err) {
      console.error(err.message);
    }
    console.log(row.id + "\t" + row.name);
  });
});

db.close((err) => {
  if (err) {
    console.error(err.message);
  }
  console.log('Close the database connection.');
});
#+end_src

#+begin_src sh :dir src :results output :exports results
node chinook.js
#+end_src

#+RESULTS:
#+begin_example
Connected to the chinook database.
1	Music
2	Movies
3	TV Shows
4	Audiobooks
5	90’s Music
6	Audiobooks
7	Movies
8	Music
9	Music Videos
10	TV Shows
11	Brazilian Music
12	Classical
13	Classical 101 - Deep Cuts
14	Classical 101 - Next Steps
15	Classical 101 - The Basics
16	Grunge
17	Heavy Metal Classic
18	On-The-Go 1
Close the database connection.
#+end_example

**** Querying all rows with ~all()~ method
#+cindex:@code{all()} method
The ~all()~ method allows you to execute an SQL query with specified parameters
and call a callback to access the rows in the result set.

#+cindex:@code{all()} method signature
#+cindex:signature, @code{all()} method
The following is the signature of the ~all()~ method:

#+begin_src js
db.all(sql, params, (err, rows) => {
    // process rows here
});
#+end_src

The ~err~ argument stores the error detail in case there an error occurred
during the execution of the query.  Otherwise, the ~err~ will be =NULL=.  If
the query is executed successfully, the ~rows~ argument contains the result set
of the query.

Because the ~all()~ method retrieves all rows and places them in memory, for
the large result set you should use the ~each()~ method instead.

{{{heading(How to query data using the ~all()~ method)}}}

#+cindex:query data using @code{all()} method
#+cindex:@code{all()} method, query data
The following example illustrates how to query data from the =playlists= table
in the sample database using the ~all()~ method:

#+caption[Query all() Method]:Query Data using ~all()~ Method
#+name:all.js
#+begin_src js :tangle src/all.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open the database
let db = new sqlite3.Database('../db/chinook.db');

let sql = `SELECT DISTINCT Name name FROM playlists
           ORDER BY name`;

db.all(sql, [], (err, rows) => {
  if (err) {
    throw err;
  }
  rows.forEach((row) => {
    console.log(row.name);
  });
});

// close the database connection
db.close();
#+end_src

Let’s run the program.

#+name:run-all.js
#+begin_src sh :dir src :results output :exports results
node all.js
#+end_src

#+RESULTS: run-all.js
#+begin_example
90’s Music
Audiobooks
Brazilian Music
Classical
Classical 101 - Deep Cuts
Classical 101 - Next Steps
Classical 101 - The Basics
Grunge
Heavy Metal Classic
Movies
Music
Music Videos
On-The-Go 1
TV Shows
#+end_example

The output shows all playlists as expected.

**** Query the first row in the result set
#+cindex:@code{get()} method
#+cindex:query using @code{get()} method
When you know that the result set contains zero or one row e.g., querying a row
based on the primary key or querying with only one aggregate function such as
~count~, ~sum~, ~max~, ~min~, etc., you can use the ~get()~ method of the
=Database= object.

#+begin_src js
db.get(sql, params, (err, row) => {
    // process the row here
});
#+end_src

#+cindex:@code{get()} method
The ~get()~ method executes an SQL query and calls the callback function on the
first result row.  In case the result set is empty, the row argument is
=undefined=.

The following ~get.js~ program demonstrates how to query a playlist by its
=id=:

#+caption[Query all()]:Query a playlist by its ~id~
#+name:get.js
#+begin_src js :tangle src/get.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open the database
let db = new sqlite3.Database('../db/chinook.db');

let sql = `SELECT PlaylistId id,
                  Name name
           FROM playlists
           WHERE PlaylistId  = ?`;
let playlistId = 1;

// first row only
db.get(sql, [playlistId], (err, row) => {
  if (err) {
    return console.error(err.message);
  }
  return row
    ? console.log(row.id, row.name)
    : console.log(`No playlist found with the id ${playlistId}`);

});

// close the database connection
db.close();
#+end_src

Let’s run the ~get.js~ program.

#+name:run-get.js
#+begin_src sh :dir src :results output :exports results
node get.js
#+end_src

#+RESULTS: run-get.js
: 1 'Music'

The output shows the =Music= playlist, which is correct.

If you change the =playlistId= to 0 and execute the ~get.js~ program again:

#+name:change-playlistId-to-0
#+begin_src sh :dir src :results output :exports results
sed -E -e '/playlistId = 1/ s/1/0/' get.js > get0.js
node get0.js
#+end_src

#+RESULTS: change-playlistId-to-0
: No playlist found with the id 0

It shows that no playlist found with =id= 0 as expected.

**** Query rows with ~each()~ method
#+cindex:@code{each()} method
#+cindex:query using @code{each()} method
The ~each()~ method executes an SQL query with specified parameters and calls a
callback for every row in the result set.

#+cindex:@code{each()} method signature
#+cindex:signature of @code{each()} method
The following illustrates the signature of the ~each()~ method:

#+begin_src js
db.each(sql,params, (err, result) => {
   // process each row here
});
#+end_src

If the result set is empty, the callback is never called.  In case there is an
error, the ~err~ parameter contains the detailed information.

The following ~each.js~ program illustrates how to use the ~each()~ method to
query customer’s data from the =customers= table.

#+caption[Query each()]:Query Data using the ~each()~ method
#+name:each.js
#+begin_src js :tangle src/each.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open the database
let db = new sqlite3.Database('../db/chinook.db');

let sql = `SELECT FirstName firstName,
                  LastName lastName,
                  Email email
            FROM customers
            WHERE Country = ?
            ORDER BY FirstName`;

db.each(sql, ['USA'], (err, row) => {
  if (err) {
    throw err;
  }
  console.log(`${row.firstName} ${row.lastName} - ${row.email}`);
});

// close the database connection
db.close();
#+end_src

#+RESULTS: each.js

Let’s run the ~each.js~ program:

#+name:run-each.js
#+begin_src sh :dir src :results output :exports results
node each.js
#+end_src

#+RESULTS: run-each.js
#+begin_example
Dan Miller - dmiller@comcast.com
Frank Harris - fharris@google.com
Frank Ralston - fralston@gmail.com
Heather Leacock - hleacock@gmail.com
Jack Smith - jacksmith@microsoft.com
John Gordon - johngordon22@yahoo.com
Julia Barnett - jubarnett@gmail.com
Kathy Chase - kachase@hotmail.com
Michelle Brooks - michelleb@aol.com
Patrick Gray - patrick.gray@aol.com
Richard Cunningham - ricunningham@hotmail.com
Tim Goyer - tgoyer@apple.com
Victor Stevens - vstevens@yahoo.com
#+end_example

As you see, the callback function was called for each row to print out the
customer’s information.

**** Executing statement in serialized mode with ~Database.serialize~
#+cindex:@code{serialize()} method
#+cindex:mode, serialized
#+cindex:serialized mode
#+cindex:execution mode, serialized
#+cindex:mode, execution, serialized
The ~serialize()~ method puts the execution mode into *serialized mode*.  It
means that /only one statement can execute at a time/.  Other statements will
wait in a queue until all the previous statements are executed.

After the ~serialize()~ method returns, the execution mode is set to the
original mode again.

#+cindex:nest @code{serialize()} methods
It’s safe to nest the ~serialize()~ methods as follows:

#+begin_src js
db.serialize(() => {
  // queries will execute in serialized mode
  db.serialize(() => {
    // queries will execute in serialized mode
  });
  // queries will execute in serialized mode
});
#+end_src

Suppose, you want to execute the following three statements in sequence:

1. Create a new table.

2. Insert data into the table.

3. Query data from the table.


To do this, you place these statements in the ~serialize()~ method as follows:

#+caption[Serialize mode]:Running Queries in ~serialize~ mode
#+name:serialize.js
#+begin_src js :tangle src/serialize.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open the database connection
let db = new sqlite3.Database(':memory:', (err) => {
  if (err) {
    console.error(err.message);
  }
});

db.serialize(() => {
  // Queries scheduled here will be serialized.
  db.run('CREATE TABLE greetings(message text)')
    .run(`INSERT INTO greetings(message)
          VALUES('Hi'),
                ('Hello'),
                ('Welcome')`)
    .each(`SELECT message FROM greetings`, (err, row) => {
      if (err){
        throw err;
      }
      console.log(row.message);
    });
});

// close the database connection
db.close((err) => {
  if (err) {
    return console.error(err.message);
  }
});
#+end_src

#+cindex:chain method calls, @code{Database} object
Because the ~run()~ method returns a =Database= object, we can chain the method
calls.

Let’s run the program to see how it works.

#+name:run-serialize.js
#+begin_src sh :dir src :results output :exports results
node serialize.js
#+end_src

#+RESULTS: run-serialize.js
: Hi
: Hello
: Welcome

It works as expected.

Notice that if you don’t place three statements in the ~serialize()~ method,
the three statements may execute in parallel, which would cause an error.

**** Executing statements in parallel with ~Database.parallelize~
#+cindex:@code{parallelize()} method
#+cindex:parallelize mode
If you want the scheduled queries to execute in parallel, you place them in the
~parallelize()~ method.

Similar to the ~serialize()~ method, it is safe to nest the ~parallelize()~
method as follows:

#+begin_src js
db.parallelize(() => {
  // queries will execute in parallel mode
  db.parallelize(() => {
    // queries will execute in parallel mode
  });
  // queries will execute in parallel mode
});
#+end_src

For the demonstration, we will create a new function that calculates the sum of
two numbers using SQLite database and place the function calls in the
~parallelize()~ method as shown in the following example:

#+caption[Parallelize mode]:Run function calls in parallel using ~parallelize~ mode
#+name:parallelize.js
#+begin_src js :tangle src/parallelize.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open a database connection
let db = new sqlite3.Database(':memory:', (err) => {
  if (err) {
    console.error(err.message);
  }
});

db.parallelize(() => {
  dbSum(1, 1, db);
  dbSum(2, 2, db);
  dbSum(3, 3, db);
  dbSum(4, 4, db);
  dbSum(5, 5, db);
});

// close the database connection
db.close((err) => {
  if (err) {
    return console.error(err.message);
  }
});

function dbSum(a, b, db) {
  db.get('SELECT (? + ?) sum', [a, b], (err, row) => {
    if (err) {
      console.error(err.message);
    }
    console.log(`The sum of ${a} and ${b} is ${row.sum}`);
  });
}
#+end_src

Let’s run the parallelize.js program.

#+name:run-parallelize.js
#+begin_src sh :dir src :results output :exports results
node parallelize.js
#+end_src

#+RESULTS: run-parallelize.js
: The sum of 1 and 1 is 2
: The sum of 2 and 2 is 4
: The sum of 3 and 3 is 6
: The sum of 4 and 4 is 8
: The sum of 5 and 5 is 10

As you see in the output, the order of execution is not the same as it was
called in the program.

Notice that the statements execute in parallel; therefore, each time you run
the program, the order of execution may be different.[fn::It's always the same
on this machine.]

*** Inserting Data Into an SQLite Table from a Node.js Application
- http://www.sqlitetutorial.net/sqlite-nodejs/insert/


- Summary :: in this tutorial, you will learn how to insert one or more row
             into an SQLite table from a Node.js application.


#+cindex:insert data
To insert data into an SQLite table from a Node.js application, you follow
these steps:

1. Open a database connection.

2. Execute an =INSERT= statement.

3. Close the database connection.


For the demonstration, we will create a new database named ~sample.db~ in the
~db/~ folder.

{{{heading(Open a Database Connection)}}}

#+cindex:default mode, open database
When you open a database connection in the =default= mode, the database is
created if it does not exist.

: let db = new sqlite3.Database('./db/sample.db');

In the ~sample.db~ database, we create a table called =langs= for storing the
programming languages:

: db.run('CREATE TABLE langs(name text)');

You can run the program to create the ~sample.db~ database and =langs= table as
follows:

#+caption[Create new database]:Create the ~sample.db~ database and =langs= Table
#+name:sample.js
#+begin_src js :tangle src/sample.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

let db = new sqlite3.Database('../db/sample.db');

db.run('CREATE TABLE langs(name text)');

db.close();
#+end_src

#+name:run-sample.js
#+begin_src sh :dir src :results output :exports results
node sample.js
#+end_src

#+RESULTS: run-sample.js

Now, we are ready to insert data into the =langs= table.

{{{heading(Insert one row into a table)}}}

#+cindex:@code{INSERT} statement using @code{run()} method
#+cindex:@code{run()} method, @code{INSERT}
To execute an =INSERT= statement, you use the ~run()~ method of the =Database=
object:

#+begin_src js
db.run(sql, params, function(err){
  //
});
#+end_src

The ~run()~ method executes an =INSERT= statement with specified parameters and
calls a callback afterwards.  If an error occurred, you can find the detailed
information in the =err= argument of the callback function.  In case the
statement is executed successfully, the ~this~ object of the callback function
will contain two properties:

- =lastID= property stores the value of the last inserted row ID.

- =changes= property stores the rows affected by the query.


The following ~insert.js~ program illustrates how to insert a row into the
=langs= table:

#+caption[Insert row]:Insert a row into the =langs= table
#+name:insert.js
#+begin_src js :tangle src/insert.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

  let db = new sqlite3.Database('../db/sample.db');

  // insert one row into the langs table
  db.run(`INSERT INTO langs(name) VALUES(?)`, ['C'], function(err) {
    if (err) {
      return console.log(err.message);
    }
    // get the last insert id
    console.log(`A row has been inserted with rowid ${this.lastID}`);
  });

  // close the database connection
  db.close();
#+end_src

Let’s run the ~insert.js~ program:

#+name:run-insert.js
#+begin_src sh :dir src :results output :exports results
node insert.js
#+end_src

#+RESULTS: run-insert.js
: A row has been inserted with rowid 1

It worked as expected.

{{{heading(Insert multiple rows into a table at a time)}}}

#+cindex:insert multiple rows
#+cindex:@code{INSERT} multiple rows
To insert multiple rows at a time into a table, you use the following form of
the =INSERT= statement:

#+begin_src sql
INSERT INTO table_name(column_name)
VALUES(value_1), (value_2), (value_3),...
#+end_src

To simulate this in the Node.js application, we first need to construct the
=INSERT= statement with multiple placeholders:

#+begin_src sql
INSERT INTO table_name(column_name)
VALUES(?), (?), (?),...
#+end_src

Suppose, you want to insert rows into the =langs= table with the data from the
following =languages= array:

: let languages = ['C++', 'Python', 'Java', 'C#', 'Go'];

To construct the =INSERT= statement, we use the ~map()~ method to map each
element in the =languages= array into =(?)= and then join all placeholders
together.

#+begin_src js
let placeholders = languages.map((language) => '(?)').join(',');
let sql = 'INSERT INTO langs(name) VALUES ' + placeholders;
#+end_src

The following ~insert-many.js~ program illustrates how to insert multiple rows
into the =langs= table:

#+caption[Insert multiple rows]:Insert multiple rows into the =langs= table
#+name:insert-many.js
#+begin_src js :tangle src/insert-many.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open the database connection
let db = new sqlite3.Database('../db/sample.db');

let languages = ['C++', 'Python', 'Java', 'C#', 'Go'];

// construct the insert statement with multiple placeholders
// based on the number of rows
let placeholders = languages.map((language) => '(?)').join(',');
let sql = 'INSERT INTO langs(name) VALUES ' + placeholders;

// output the INSERT statement
console.log(sql);

db.run(sql, languages, function(err) {
  if (err) {
    return console.error(err.message);
  }
  console.log(`Rows inserted ${this.changes}`);
});

// close the database connection
db.close();
#+end_src

Let’s run the ~insert-many.js~ program to see how it works.

#+name:run-insert-many.js
#+begin_src sh :dir src :results output :exports results
node insert-many.js
#+end_src

#+RESULTS: run-insert-many.js
: INSERT INTO langs(name) VALUES (?),(?),(?),(?),(?)
: Rows inserted 5

It inserted 5 rows into the =langs= table, which is what we expected.

*** Updating Data in SQLite Database from a Node.js Application
- http://www.sqlitetutorial.net/sqlite-nodejs/update/


- Summary :: this tutorial shows you how to update data in the SQLite database
             from a Node.js application.


#+cindex:update data
#+cindex:@code{UPDATE} statement
To update data in the SQLite database from a Node.js application, you use these
steps:

1. Open a database connection.

2. Execute an =UPDATE= statement.

3. Close the database connection


For the demonstration, we will use the =langs= table in the ~sample.db~
database that we created in the previous tutorial.

{{{heading(Updating data example)}}}

#+cindex:@code{UDPATE} syntax
To update data in a table, you use the =UPDATE= statement as follows:

#+begin_src sql
UPDATE table_name
SET column_name = value_1
WHERE id = id_value;
#+end_src

To execute the =UPDATE statement in the Node.js application, you call the
~run()~ method of the =Database= object:

#+begin_src js
db.run(sql, params, function(err){
  //
});
#+end_src

The ~run()~ method executes an =UPDATE= statement with specified parameters and
calls a callback afterwards.  The =err= argument of the callback stores the
error detail in case the execution has any problem e.g., syntax error, locking,
etc.  If the =UPDATE= statement is executed successfully, the ~this~ object of
the callback function will contain the =changes= property that stores the
number of rows updated.

The following ~update.js~ program illustrates how to update a row in the
=langs= table from C to Ansi C:

#+caption[Update row]:How to update a row in the =langs= table
#+name:update.js
#+begin_src js :tangle src/update.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open a database connection
let db = new sqlite3.Database('../db/sample.db');

//
let data = ['Ansi C', 'C'];
let sql = `UPDATE langs
            SET name = ?
            WHERE name = ?`;

db.run(sql, data, function(err) {
  if (err) {
    return console.error(err.message);
  }
  console.log(`Row(s) updated: ${this.changes}`);

});

// close the database connection
db.close();
#+end_src

Let’s test the ~update.js~ program.

#+name:run-update.js
#+begin_src sh :dir src
node update.js
#+end_src

#+RESULTS: run-update.js
: Row(s) updated: 1

The output showed that one row has been updated which is correct.

*** Deleting Data in SQLite Database from a Node.js Application
- http://www.sqlitetutorial.net/sqlite-nodejs/delete/


- Summary :: in this tutorial, you will learn how to delete data in the SQLite
             database from a Node.js application.


#+cindex:delete data
#+cindex:@code{DELETE} statement
To delete data in the SQLite database from a Node.js application, you use the
following steps:

1. Open a database connection.

2. Execute a =DELETE= statement.

3. Close the database connection.


For the demonstration, we will use the =langs= table in the ~sample.db~
database that we created in the previous tutorial.

{{{heading(Deleting data example)}}}

#+cindex:@code{DELETE} syntax
To delete data from a table, you use the =DELETE= statement as follows:

#+begin_src sql
DELETE FROM table_name
WHERE column_name = value;
#+end_src

To execute the =DELETE= statement from a Node.js application, you call the
~run()~ method of the =Database= object as follows:

#+begin_src js
db.run(sql, params, function(err) {
  //
});
#+end_src

The ~run()~ method allows you to execute a =DELETE= statement with specified
parameters and calls a callback function afterwards.

If there was any error during the execution of =DELETE= statement, the =err=
argument of the callback function will provide the detail.  In case the
=DELETE= statement executed successfully, the ~this~ object of the callback
function will contain the =changes= property that stores the number of rows
deleted.

The following ~delete.js~ program illustrates how to delete a row from the
=langs= table:

#+caption[Delete row]:How to delete a row from the =langs= table
#+name:delete.js
#+begin_src js :tangle src/delete.js :mkdirp yes
const sqlite3 = require('sqlite3').verbose();

// open a database connection
let db = new sqlite3.Database('../db/sample.db', (err) => {
  if (err) {
    console.error(err.message);
  }
});

let id = 1;
// delete a row based on id
db.run(`DELETE FROM langs WHERE rowid=?`, id, function(err) {
  if (err) {
    return console.error(err.message);
  }
  console.log(`Row(s) deleted ${this.changes}`);
});

// close the database connection
db.close((err) => {
  if (err) {
    return console.error(err.message);
  }
});
#+end_src

Let’s test the ~delete.js~ program.

#+name:run-delete.js
#+begin_src sh :dir src :results output :exports results
node delete.js
#+end_src

#+RESULTS: run-delete.js
: Row(s) deleted 1

The output showed that one row has been deleted successfully.

